{"data":{"markdownRemark":{"html":"<h2>devhost:18</h2>\n<p>devhost:18 was the first annual Student Developers meet organised by Sahyadri Open-Source Community (SOSC) to bring together young and talented developers from in and around Mangalore. devhost:18 was aimed to create a platform to join together clubs and organizations to spread the information on latest techologies and trends in the IT industry and train the students to be part of it.</p>\n<p>devhost:18 was a two day event which took place on 4th and 5th May 2018 and had speakers from various organizations. The event was open-to-all and was free of cost for anyone who was interested.</p>\n<h2>DAY 1</h2>\n<image src=\"https://storage.googleapis.com/tempdsc/day1.jpg\" width=400 height=500>\n<p>Day 1 started with inauguration of Sahyadri Open Source (SOSC)'s new workspace by Ms. Swathi Bavanaka, then it was followed by a speech from Dr. Umesh. M. Bhushi, Director of stratergy and planning, Sahyadri College of Engineering and Management.</p>\n<h4>UX: Getting your app to Market</h4>\n<p>Day's first technical session was taken by Women Techmaker Lead, Ms. Swathi Bavanaka based on Products and User Experience called \"UX: Getting your App to Market\". This session was mainly focused on how to produce user-friendly apps for the market.</p>\n<image src=\"shwathi.jpg\">\n<h4>Intro to DataScience</h4>\n<p>This session was followed by another technical session on Machine Learning and Deep Learning by former Microsoft employee Mr.Subash Konda called \"Intro to Modern Data Science\", this session gave a brief introduction about the Machine Learning and Data Science to the attendees. At the end of the sessions a Q&#x26;A session took place where swags and prizes were distributed to attendees.</p>\n<image src=\"subhash.jpg\">\n<h2>DAY 2</h2>\n<h3>Modern Application Security</h3>\n<p>Day 2 started out with Hands on Modern Application Security session by Defcon Speaker Mr. Madhu Akula. This session was aimed on making safer and reliable applications and avoid data leaks, privacy breaches and other security related issues.</p>\n<image src=\"Madhu_akula.jpg\">\n<h3>Authentication and Authorization as a Service</h3>\n<p>This session was followed by another security based technical session by Mr. Mehul Patel (Rowdy Mehul) from Auth0 which was about Authorization and Authenication.</p>\n<image src=\"Mehul_patel.jpg\">\n<h3>Dive into Virtual Reality</h3>\n<p>Day 2's last session was by a Mozilla Rep Speaker Mr.Prathmesh Chavan which was a hands on session on Virtual Reality. This session introduced all the attendees to how VR works and how useful it is in today's world, this session also gave attendees hands on experience on VR.</p>\n<image src=\"prathamesh_chavan.jpg\">\n<p>At the end of the sessions, a Q&#x26;A session was arranged where Swags and Prizes were distributed to attendees. The day ended with a Thanking Speech to the speakers and all the attendees.\nThe event was a grand success as this brought many like minded people and communities together in one place.</p>","frontmatter":{"slug":"/events/devhost18","name":"devhost:18","location":"Seminar Hall","date":"20-Dec-2019","cover":{"publicURL":"/static/cover-92086508d77bbd9557768c067025584f.jpg","childImageSharp":{"fluid":{"tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='400' height='280'%3e%3cpath d='M0 140v140h401V0H0v140m85-1l1 38h238v-76H85v38m4 0v34h231v-69H89v35m27-10c0 5 0 5-3 4-5-3-12 2-13 9s7 15 13 12h9v-30h-2c-3 0-3 1-4 5m60-4l-1 15v14h3c2 0 2 0 2-7s1-9 5-9c2 0 3 1 3 8v8h6v-7c0-12-4-17-11-14l-3 1v-5c0-5-2-7-4-4m66 3l-1 5-2 2 2 3 1 8c0 8 0 8 3 8 2 0 2 0 2-8 0-6 0-8 2-8v-5l-2-5c0-3-1-4-3-4s-2 0-2 4m49-3c-4 1-6 6-4 10 1 3 1 4-1 6-1 4-1 9 2 12 2 3 10 3 14 0 3-3 4-10 1-13-2-1-2-2 0-4 3-7-4-13-12-11m-24 2c-3 2-2 3 0 3 4 0 4 1 4 13v11h5v-29h-4l-5 2m-134 6c-8 2-9 16-2 20 4 2 12 1 14-1v-3h-4c-2 2-9 0-9-3l8-1h8v-3c0-4-3-7-7-9h-8m31 5l-3 6-3-5c-1-5-2-6-4-6-4 0-4 0 0 10l4 8c3 6 6 3 12-12v-6c-3-2-3-1-6 5m42-5c-7 1-11 11-6 17 7 10 22 1 19-10-1-3-7-8-9-8l-4 1m21 0c-6 1-5 9 1 12 5 3 5 6-1 4-3-1-6 1-4 3 3 3 10 3 13 0 2-5-1-10-7-12l-1-2h3c2 1 5 0 5-2l-6-4-3 1m-119 6c-3 2-3 7 0 9 6 4 12-4 7-9-4-2-4-2-7 0m97 0c-5 5 0 13 5 10 3-2 4-3 4-6 0-5-6-7-9-4' fill='%23d3d3d3' fill-rule='evenodd'/%3e%3c/svg%3e","aspectRatio":1.4285714285714286,"src":"/static/92086508d77bbd9557768c067025584f/2f7e7/cover.jpg","srcSet":"/static/92086508d77bbd9557768c067025584f/4d406/cover.jpg 250w,\n/static/92086508d77bbd9557768c067025584f/32ee9/cover.jpg 500w,\n/static/92086508d77bbd9557768c067025584f/2f7e7/cover.jpg 1000w","sizes":"(max-width: 1000px) 100vw, 1000px"}}}}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}